app/Imports/EmployeesImport.php

    public function model(array $row)
    {
        // Buscamos si el empleado ya existe por cédula para no duplicarlo
        $existingEmployee = Employee::where('cedula', $row['cedula'])->first();
---
select * from "employees" where "cedula" = 12345678 limit 1