app/Http/Controllers/AttendanceController.php

    public function report(Request $request)
    {
        $search = $request->input('search');

        // 1. DETERMINAR RANGO DE FECHAS (Desde el 1ero del mes hasta el último día)
        // Usamos fillter_var o chequeo manual para asegurar que si llega vacío, se asigne el mes actual
        $fecha_inicio = $request->filled('desde')
            ? $request->desde
            : Carbon::now()->startOfMonth()->toDateString();

        $fecha_fin = $request->filled('hasta')
            ? $request->hasta
            : Carbon::now()->endOfMonth()->toDateString();

        // 2. OBTENER ASISTENCIAS
        $queryAsistencias = Attendance::with('employee')
            ->whereDate('date', '>=', $fecha_inicio)
            ->whereDate('date', '<=', $fecha_fin);

        if ($search) {
            $queryAsistencias->whereHas('employee', function ($q) use ($search) {
                $q->where('nombres', 'like', "%{$search}%")
                  ->orWhere('apellidos', 'like', "%{$search}%")
                  ->orWhere('cedula', 'like', "%{$search}%");
            });
        }

        $asistenciasList = $queryAsistencias->get()->map(function ($item) {
            $item->es_inasistencia = false;
            if($item->total_work_minutes) {
                $h = floor($item->total_work_minutes / 60);
                $m = $item->total_work_minutes % 60;
                $item->tiempo_efectivo = sprintf('%02d:%02d', $h, $m);
            } else {
                $item->tiempo_efectivo = '---';
            }
            return $item;
        });
---
select * from "attendances" where strftime('%Y-%m-%d', "date") >= cast('2026-03-01' as text) and strftime('%Y-%m-%d', "date") <= cast('2026-03-31' as text)
select * from "employees" where "employees"."id" in (4)

    public function store(Request $request)
    {
        $request->validate([
            'cedula' => 'required|exists:employees,cedula',
            'method' => 'nullable|string'
        ]);

        try {
            $employee = Employee::where('cedula', $request->cedula)->first();
            $now = Carbon::now();
            $today = $now->toDateString();

            $config = Setting::whereIn('key', ['p_hora_entrada', 'p_tolerancia', 'p_hora_salida'])
                             ->pluck('value', 'key');

            $h_entrada  = Carbon::parse($today . ' ' . ($config['p_hora_entrada'] ?? '08:00'));
            $tolerancia = (int) ($config['p_tolerancia'] ?? 0);
            $h_salida   = Carbon::parse($today . ' ' . ($config['p_hora_salida'] ?? '17:00'));

            $attendance = Attendance::where('employee_id', $employee->id)
                ->whereDate('date', $today)
                ->whereNull('check_out')
                ->latest()
                ->first();
---
select * from "employees" where "cedula" = '18313082' limit 1
select "value", "key" from "settings" where "key" in ('p_hora_entrada', 'p_tolerancia', 'p_hora_salida')
select * from "attendances" where "employee_id" = 5 and strftime('%Y-%m-%d', "date") = cast('2026-03-07' as text) and "check_out" is null order by "created_at" desc limit 1

                    $minutosTarde = $h_entrada->diffInMinutes($now, false);
                }

                Attendance::create([
                    'employee_id'  => $employee->id,
                    'date'         => $today,
                    'check_in'     => $now->toDateTimeString(),
                    'entry_status' => $estatusEntrada,
                    'minutes_late' => max(0, $minutosTarde),
                    'method'       => $request->input('method', 'manual'),
                ]);
---
insert into "attendances" ("employee_id", "date", "check_in", "entry_status", "minutes_late", "method", "updated_at", "created_at") values (5, '2026-03-07 00:00:00', '2026-03-07 19:04:40', 'puntual', 0, 'manual', '2026-03-07 19:04:40', '2026-03-07 19:04:40')

    public function destroy($id)
    {
        try {
            $attendance = Attendance::findOrFail($id);
            $attendance->delete();
---
select * from "attendances" where "attendances"."id" = '2' limit 1
delete from "attendances" where "id" = 2