app/Http/Controllers/EmployeeController.php

select * from "employees" order by "created_at" desc limit 10 offset 0
select count(*) as aggregate from "employees"
select "value", "key" from "settings"
---
    public function index()
    {
        $employees = Employee::latest()->paginate(10);
        $settings = Setting::pluck('value', 'key')->all();

select "value", "key" from "settings"
---
    public function create()
    {
        $settings = Setting::pluck('value', 'key')->all();

insert into "employees" ("cedula", "nombres", "apellidos", "cargo", "telefono", "email", "foto", "updated_at", "created_at") values ('14400594', 'Gerardo de Jesús', 'Diaz Labrador', 'Administrativo', '04120715591', 'gerakisnacuy@gmail.com', 'employees/photos/xdZTWVL96K9W698yI9UTO9EyGDNsrFJbk7eFXNwG.jpg', '2026-03-07 20:30:18', '2026-03-07 20:30:18')
---
    public function store(Request $request)
    {
        $request->validate([
            'cedula' => 'required|unique:employees,cedula',
            'nombres' => 'required|string|max:255',
            'apellidos' => 'required|string|max:255',
            'cargo' => 'required',
            'telefono' => 'nullable|string|max:20',
            'email' => 'nullable|email',
            'foto' => 'nullable|image|mimes:jpg,jpeg,png|max:2048',
        ]);

        $data = $request->all();

        if ($request->hasFile('foto')) {
            $path = $request->file('foto')->store('employees/photos', 'public');
            $data['foto'] = $path;
        }

        Employee::create($data);

select "value", "key" from "settings"
---
    public function edit(Employee $employee)
    {
        $settings = Setting::pluck('value', 'key')->all();

update "employees" set "telefono" = '04120715591', "updated_at" = '2026-03-08 22:28:17' where "id" = 4
---
    public function update(Request $request, Employee $employee)
    {
        $request->validate([
            'cedula' => 'required|unique:employees,cedula,' . $employee->id,
            'nombres' => 'required|string|max:255',
            'apellidos' => 'required|string|max:255',
            'cargo' => 'required',
            'telefono' => 'nullable|string|max:20',
            'email' => 'nullable|email',
            'foto' => 'nullable|image|mimes:jpg,jpeg,png|max:2048',
        ]);

        $data = $request->all();

        if ($request->hasFile('foto')) {
            // Eliminar foto anterior si existe
            if ($employee->foto) {
                Storage::disk('public')->delete($employee->foto);
            }
            $path = $request->file('foto')->store('employees/photos', 'public');
            $data['foto'] = $path;
        }

        $employee->update($data);

select "value", "key" from "settings"
---
    public function show(Employee $employee)
    {
        $settings = Setting::pluck('value', 'key')->all();