app/Http/Controllers/ReporteController.php

        $asistencias = $queryAsistencias->get();
        $inasistencias = $queryInasistencias->get();

        $settings = Setting::first();
---
select * from "settings" limit 1