app/Http/Controllers/SettingController.php

    public function index()
    {
        // Convertimos todas las filas en un array asociativo ['key' => 'value']
        $settings = Setting::pluck('value', 'key')->all();
---
select "value", "key" from "settings"

    public function update(Request $request)
    {
        // 1. Validación exhaustiva
        $request->validate([
            'site_name'       => 'required|string|max:255',
            'site_rif'        => 'required|string|max:20',
            'site_phone'      => 'nullable|string|max:20',
            'site_email'      => 'nullable|email|max:255',
            'site_address'    => 'nullable|string',
            'primary_color'   => 'required|string|size:7',
            'secondary_color' => 'required|string|size:7',
            'theme_mode'      => 'required|in:light,dark',
            'site_logo'       => 'nullable|image|mimes:jpg,jpeg,png,svg|max:2048',

            // --- CAMPOS DE ASISTENCIA ---
            'p_hora_entrada'  => 'required|string',
            'p_tolerancia'    => 'required|integer|min:0',
            'p_hora_salida'   => 'required|string',
        ]);

        // 2. Procesar la subida del Logo (Si existe)
        if ($request->hasFile('site_logo')) {
            // Buscamos si ya existe un logo previo para borrar el archivo físico
            $currentLogo = Setting::where('key', 'site_logo')->value('value');
---
select "value" from "settings" where "key" = 'site_logo' limit 1


            // Guardamos el nuevo logo
            $path = $request->file('site_logo')->store('logos', 'public');
            Setting::updateOrCreate(['key' => 'site_logo'], ['value' => $path]);
---
insert into "settings" ("key", "value", "updated_at", "created_at") values ('site_logo', 'logos/Wf4quqVYUKwRi4b0uoa31PPACyU5W9G3EDGGWGlz.png', '2026-03-08 13:48:53', '2026-03-08 13:48:53')
select * from "settings" where ("key" = 'site_logo') limit 1

        $inputs = $request->except(['_token', '_method', 'site_logo']);

        foreach ($inputs as $key => $value) {
            Setting::updateOrCreate(
                ['key' => $key],
                ['value' => $value]
            );
---
insert into "settings" ("key", "value", "updated_at", "created_at") values ('site_rif', 'J-00133027-5', '2026-03-08 13:48:53', '2026-03-08 13:48:53')
select * from "settings" where ("key" = 'site_name') limit 1