app/Http/Controllers/SettingController.php

update "settings" set "value" = 'U.E.C Timoteo Aguirre Pe', "updated_at" = '2026-03-08 13:48:53' where "id" = 1
---
        $inputs = $request->except(['_token', '_method', 'site_logo']);

        foreach ($inputs as $key => $value) {
            Setting::where('key', $key)->update(['value' => $value]);