app/Http/Controllers/UserController.php

    public function index()
    {
        $usuarios = User::all();
---
select * from "users"

    public function store(Request $request)
    {
        $request->validate([
            'name' => ['required', 'string', 'max:255'],
            'email' => ['required', 'string', 'lowercase', 'email', 'max:255', 'unique:'.User::class],
            'password' => ['required', 'confirmed', Rules\Password::defaults()],
            'role' => ['required', 'string', 'in:super_admin,admin,assistant'],
        ]);

        User::create([
            'name' => $request->name,
            'email' => $request->email,
            'password' => Hash::make($request->password),
            'role' => $request->role,
        ]);
---
insert into "users" ("name", "email", "password", "role", "updated_at", "created_at") values ('Gerardo Diaz', 'gerakisnacuy@gmail.com', '$2y$12$LWvgu25d8l9j8DjtOF/bvulph6SkHv9mnFbA5qDoIt1awtSh1uazm', 'admin', '2026-03-07 20:31:01', '2026-03-07 20:31:01')

    public function update(Request $request, User $usuario)
    {
        $request->validate([
            'name' => ['required', 'string', 'max:255'],
            'email' => ['required', 'string', 'lowercase', 'email', 'max:255', 'unique:users,email,'.$usuario->id],
            'role' => ['required', 'string', 'in:super_admin,admin,assistant'],
        ]);

        $usuario->update($request->only('name', 'email', 'role'));
---
update "users" set "role" = 'super_admin', "updated_at" = '2026-03-08 16:23:00' where "id" = 3