app/Providers/AppServiceProvider.php

    public function boot(): void
    {
        /**
         * Compartir configuraciones globales con todas las vistas
         * Verificamos que no estemos en consola y que la tabla exista para evitar errores.
         */
        if (!app()->runningInConsole()) {
            if (Schema::hasTable('settings')) {
                // Obtenemos un array clave => valor de la tabla settings
                $settings = Setting::pluck('value', 'key')->all();
---
select "value", "key" from "settings"